In [20]:
import pandas as pd

In [21]:
df=pd.read_csv("C:\\Users\\User\\Downloads\\dataset_review.csv - dataset_review.csv.csv")

In [22]:
df.head(5)

    Book   p1   p2 p3   p4 p5   p6 p7 p8
0  book1  3.5    2  5    3  -    -  5  3
1  book2    2  3.5  1    4  4  4.5  2  -
2  book3    -    4  1  4.5  1    4  -  -
3  book4  4.5    -  3    -  4    5  3  5
4  book5    5    2  5    3  -    5  5  4

In [23]:
df.tail(3)

    Book   p1   p2 p3   p4 p5   p6 p7   p8
5  book6  1.5  3.5  1  4.5  -  4.5  4  2.5
6  book7  2.5    -  -    4  4    4  5    3
7  book8    2    3  -    2  1    4  -    -

In [24]:
print(df.columns)

Index(['Book', 'p1', 'p2', 'p3', 'p4', 'p5', 'p6', 'p7', 'p8'], dtype='object')

In [25]:
print(df.dtypes)

Book    object
p1      object
p2      object
p3      object
p4      object
p5      object
p6      object
p7      object
p8      object
dtype: object

In [26]:
print(df)

    Book   p1   p2 p3   p4 p5   p6 p7   p8
0  book1  3.5    2  5    3  -    -  5    3
1  book2    2  3.5  1    4  4  4.5  2    -
2  book3    -    4  1  4.5  1    4  -    -
3  book4  4.5    -  3    -  4    5  3    5
4  book5    5    2  5    3  -    5  5    4
5  book6  1.5  3.5  1  4.5  -  4.5  4  2.5
6  book7  2.5    -  -    4  4    4  5    3
7  book8    2    3  -    2  1    4  -    -

In [27]:
df_subset=df.replace('_',float("NaN"))

In [28]:
print(df_subset)

    Book   p1   p2 p3   p4 p5   p6 p7   p8
0  book1  3.5    2  5    3  -    -  5    3
1  book2    2  3.5  1    4  4  4.5  2    -
2  book3    -    4  1  4.5  1    4  -    -
3  book4  4.5    -  3    -  4    5  3    5
4  book5    5    2  5    3  -    5  5    4
5  book6  1.5  3.5  1  4.5  -  4.5  4  2.5
6  book7  2.5    -  -    4  4    4  5    3
7  book8    2    3  -    2  1    4  -    -

In [29]:
df_subset=df.replace('-',float("NaN"))

In [38]:
print(df_subset)

    Book   p1   p2   p3   p4   p5   p6   p7   p8
0  book1  3.5    2    5    3  NaN  NaN    5    3
1  book2    2  3.5    1    4    4  4.5    2  NaN
2  book3  NaN    4    1  4.5    1    4  NaN  NaN
3  book4  4.5  NaN    3  NaN    4    5    3    5
4  book5    5    2    5    3  NaN    5    5    4
5  book6  1.5  3.5    1  4.5  NaN  4.5    4  2.5
6  book7  2.5  NaN  NaN    4    4    4    5    3
7  book8    2    3  NaN    2    1    4  NaN  NaN

In [17]:
print(df_subset.dropna())

Empty DataFrame
Columns: [Book, p1, p2, p3, p4, p5, p6, p7, p8]
Index: []

In [30]:
df2=[df_subset["p1"].notnull()]

In [31]:
print(df2)

[0     True
1     True
2    False
3     True
4     True
5     True
6     True
7     True
Name: p1, dtype: bool]

In [40]:
df2=df_subset[df_subset["p1"].notnull()]

In [33]:
print(df2)

    Book   p1   p2   p3   p4   p5   p6   p7   p8
0  book1  3.5    2    5    3  NaN  NaN    5    3
1  book2    2  3.5    1    4    4  4.5    2  NaN
3  book4  4.5  NaN    3  NaN    4    5    3    5
4  book5    5    2    5    3  NaN    5    5    4
5  book6  1.5  3.5    1  4.5  NaN  4.5    4  2.5
6  book7  2.5  NaN  NaN    4    4    4    5    3
7  book8    2    3  NaN    2    1    4  NaN  NaN

In [41]:
df2=df2[df2["p2"].notnull()]

In [35]:
print(df2)

    Book   p1   p2   p3   p4   p5   p6   p7   p8
0  book1  3.5    2    5    3  NaN  NaN    5    3
1  book2    2  3.5    1    4    4  4.5    2  NaN
4  book5    5    2    5    3  NaN    5    5    4
5  book6  1.5  3.5    1  4.5  NaN  4.5    4  2.5
7  book8    2    3  NaN    2    1    4  NaN  NaN

In [43]:
print(df2["p5"].isnull().sum())

3

In [44]:
df3=df.drop(["p7","p5"],axis=1)

In [45]:
print(df3)

    Book   p1   p2 p3   p4   p6   p8
0  book1  3.5    2  5    3    -    3
1  book2    2  3.5  1    4  4.5    -
2  book3    -    4  1  4.5    4    -
3  book4  4.5    -  3    -    5    5
4  book5    5    2  5    3    5    4
5  book6  1.5  3.5  1  4.5  4.5  2.5
6  book7  2.5    -  -    4    4    3
7  book8    2    3  -    2    4    -

In [50]:
df2=df2.drop(["p7","p5"],axis=1)

In [51]:
print(df2)

    Book   p1   p2   p3   p4   p6   p8
0  book1  3.5    2    5    3  NaN    3
1  book2    2  3.5    1    4  4.5  NaN
4  book5    5    2    5    3    5    4
5  book6  1.5  3.5    1  4.5  4.5  2.5
7  book8    2    3  NaN    2    4  NaN